{
  "id": "LandUse",
  "name": "Land Use feature types",
  "definition": "The Land Use Foundation Theme describes human activities in the built and natural environments and includes both existing and future uses of land and natural resources.",
  "concepts": [
    {
      "id": "MapDocument",
      "name": "Map Document",
      "definition": "The scanned plan and structural drawing which may geo-referenced e.g. raster images, vector drawings.",
      "superclasses": [
        "AbstractFeatureType"
      ]
    },
    {
      "id": "OfficialDocument",
      "name": "Official Document",
      "definition": "The document drawn up by public authorities and other state bodies appointed for this purpose that may be associated with the complete spatial plan or any its object.",
      "superclasses": [
        "AbstractFeatureType"
      ]
    },
    {
      "id": "PlannedParcel",
      "name": "Planned Parcel",
      "definition": "The planned plot object represents a part of the land area with a specific land use intended for establishing the Land Parcel object.",
      "superclasses": [
        "ZoningElement"
      ]
    },
    {
      "id": "RegulationText",
      "name": "Regulation Text",
      "definition": "Independently readable piece of text that starts with a capital letter and ends with a period.",
      "superclasses": [
        "AbstractFeatureType"
      ]
    },
    {
      "id": "RoadSupplementaryRegulation",
      "name": "Road Supplementary Regulation",
      "definition": "Areas used for road transport (e.g. roads, parking areas, service stations).",
      "superclasses": [
        "SupplementaryRegulation"
      ]
    },
    {
      "id": "SpatialPlan",
      "name": "Spatial Plan",
      "definition": "A set of documents that indicates a strategic direction for the development of a given geographic area, states the policies, priorities, programmes and land allocations that will implement the strategic direction and influences the distribution of people and activities in spaces of various scales. Spatial plans may be developed for urban planning, regional planning, environmental planning, landscape planning, national spatial plans.",
      "superclasses": [
        "AbstractFeatureType"
      ]
    },
    {
      "id": "SupplementaryRegulation",
      "name": "Supplementary Regulation",
      "definition": "A feature (point, line or polygon) of a spatial plan that provides supplementary information and/or limitation of the use of land/water necessary for spatial planning reasons or to formalize external rules defined in legal text. The supplementary regulations affects all land use that overlap with the geometry. For example, an air field generates restrictions in its surroundings regarding aircraft landing, radar and telecommunication devices. It is the buffer around these features that generates the supplementary regulation on the Land Use.",
      "superclasses": [
        "AbstractFeatureType"
      ]
    },
    {
      "id": "UrbanBoundary",
      "name": "Urban Boundary",
      "definition": "A regional boundary set in an attempt to control urban sprawl.",
      "superclasses": [
        "SupplementaryRegulation"
      ]
    },
    {
      "id": "ZoningElement",
      "name": "Zoning Element",
      "definition": "A Feature which is homogeneous regarding the permitted uses of land based on zoning which separate one set of land uses from another.",
      "superclasses": [
        "AbstractFeatureType"
      ]
    },
    {
      "id": "ExistingLandUseCollection",
      "name": "Existing Land Use Collection",
      "definition": "A collection of units (areas or locations) for which information on existing land use is provided as a polygon.",
      "superclasses": [
        "AbstractFeatureType"
      ]
    },
    {
      "id": "ExistingLandUseUnit",
      "name": "Existing Land Use Unit",
      "definition": "A land use unit which is part of a Land Use Collection. (A Land Use Collection is a collection of Land Use Units, each one being called a member.)",
      "superclasses": [
        "AbstractFeatureType"
      ]
    },
    {
      "id": "LandUseGridCoverage",
      "name": "Land Use Grid Coverage",
      "definition": "A raster representation of Land Use data. Source: ISO 19123.",
      "superclasses": [
        "RectifiedGridCoverage"
      ]
    },
    {
      "id": "ParcelLandUse",
      "name": "Parcel Land Use",
      "definition": "Land Use information within the parcel object.",
      "superclasses": [
        "AbstractFeatureType"
      ]
    }
  ]
}